Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/pio.h
//               push (PUSH IFFULL), will take place.
//               Write 0 for value of 32.
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_RESET  _u(0x00)
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_BITS   _u(0x01f00000)
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_MSB    _u(24)
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_LSB    _u(20)
#define PIO_SM3_SHIFTCTRL_PUSH_THRESH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR
// Description : 1 = shift out of output shift register to right. 0 = to left.
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_RESET  _u(0x1)
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_BITS   _u(0x00080000)
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_MSB    _u(19)
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_LSB    _u(19)
#define PIO_SM3_SHIFTCTRL_OUT_SHIFTDIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_SHIFTCTRL_IN_SHIFTDIR
// Description : 1 = shift input shift register to right (data enters from
//               left). 0 = to left.
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_RESET  _u(0x1)
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_BITS   _u(0x00040000)
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_MSB    _u(18)
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_LSB    _u(18)
#define PIO_SM3_SHIFTCTRL_IN_SHIFTDIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_SHIFTCTRL_AUTOPULL
// Description : Pull automatically when the output shift register is emptied,
//               i.e. on or following an OUT instruction which causes the output
//               shift counter to reach or exceed PULL_THRESH.
#define PIO_SM3_SHIFTCTRL_AUTOPULL_RESET  _u(0x0)
#define PIO_SM3_SHIFTCTRL_AUTOPULL_BITS   _u(0x00020000)
#define PIO_SM3_SHIFTCTRL_AUTOPULL_MSB    _u(17)
#define PIO_SM3_SHIFTCTRL_AUTOPULL_LSB    _u(17)
#define PIO_SM3_SHIFTCTRL_AUTOPULL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_SHIFTCTRL_AUTOPUSH
// Description : Push automatically when the input shift register is filled,
//               i.e. on an IN instruction which causes the input shift counter
//               to reach or exceed PUSH_THRESH.
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_RESET  _u(0x0)
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_BITS   _u(0x00010000)
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_MSB    _u(16)
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_LSB    _u(16)
#define PIO_SM3_SHIFTCTRL_AUTOPUSH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT
// Description : If 1, disable this state machine's RX FIFO, make its storage
//               available for random write access by the state machine (using
//               the `put` instruction) and, unless FJOIN_RX_GET is also set,
//               random read access by the processor (through the RXFx_PUTGETy
//               registers).
//
//               If FJOIN_RX_PUT and FJOIN_RX_GET are both set, then the RX
//               FIFO's registers can be randomly read/written by the state
//               machine, but are completely inaccessible to the processor.
//
//               Setting this bit will clear the FJOIN_TX and FJOIN_RX bits.
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_RESET  _u(0x0)
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_BITS   _u(0x00008000)
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_MSB    _u(15)
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_LSB    _u(15)
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_PUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_SHIFTCTRL_FJOIN_RX_GET
// Description : If 1, disable this state machine's RX FIFO, make its storage
//               available for random read access by the state machine (using
//               the `get` instruction) and, unless FJOIN_RX_PUT is also set,
//               random write access by the processor (through the RXFx_PUTGETy
//               registers).
//
//               If FJOIN_RX_PUT and FJOIN_RX_GET are both set, then the RX
//               FIFO's registers can be randomly read/written by the state
//               machine, but are completely inaccessible to the processor.
//
//               Setting this bit will clear the FJOIN_TX and FJOIN_RX bits.
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_RESET  _u(0x0)
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_BITS   _u(0x00004000)
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_MSB    _u(14)
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_LSB    _u(14)
#define PIO_SM3_SHIFTCTRL_FJOIN_RX_GET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_SHIFTCTRL_IN_COUNT
// Description : Set the number of pins which are not masked to 0 when read by
//               an IN PINS, WAIT PIN or MOV x, PINS instruction.
//
//               For example, an IN_COUNT of 5 means that the 5 LSBs of the IN
//               pin group are visible (bits 4:0), but the remaining 27 MSBs are
//               masked to 0. A count of 32 is encoded with a field value of 0,
//               so the default behaviour is to not perform any masking.
//
//               Note this masking is applied in addition to the masking usually
//               performed by the IN instruction. This is mainly useful for the
//               MOV x, PINS instruction, which otherwise has no way of masking
//               pins.
#define PIO_SM3_SHIFTCTRL_IN_COUNT_RESET  _u(0x00)
#define PIO_SM3_SHIFTCTRL_IN_COUNT_BITS   _u(0x0000001f)
#define PIO_SM3_SHIFTCTRL_IN_COUNT_MSB    _u(4)
#define PIO_SM3_SHIFTCTRL_IN_COUNT_LSB    _u(0)
#define PIO_SM3_SHIFTCTRL_IN_COUNT_ACCESS "RW"
// =============================================================================
// Register    : PIO_SM3_ADDR
// Description : Current instruction address of state machine 3
#define PIO_SM3_ADDR_OFFSET _u(0x0000011c)
#define PIO_SM3_ADDR_BITS   _u(0x0000001f)
#define PIO_SM3_ADDR_RESET  _u(0x00000000)
#define PIO_SM3_ADDR_MSB    _u(4)
#define PIO_SM3_ADDR_LSB    _u(0)
#define PIO_SM3_ADDR_ACCESS "RO"
// =============================================================================
// Register    : PIO_SM3_INSTR
// Description : Read to see the instruction currently addressed by state
//               machine 3's program counter
//               Write to execute an instruction immediately (including jumps)
//               and then resume execution.
#define PIO_SM3_INSTR_OFFSET _u(0x00000120)
#define PIO_SM3_INSTR_BITS   _u(0x0000ffff)
#define PIO_SM3_INSTR_RESET  "-"
#define PIO_SM3_INSTR_MSB    _u(15)
#define PIO_SM3_INSTR_LSB    _u(0)
#define PIO_SM3_INSTR_ACCESS "RW"
// =============================================================================
// Register    : PIO_SM3_PINCTRL
// Description : State machine pin control
#define PIO_SM3_PINCTRL_OFFSET _u(0x00000124)
#define PIO_SM3_PINCTRL_BITS   _u(0xffffffff)
#define PIO_SM3_PINCTRL_RESET  _u(0x14000000)
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_PINCTRL_SIDESET_COUNT
// Description : The number of MSBs of the Delay/Side-set instruction field
//               which are used for side-set. Inclusive of the enable bit, if
//               present. Minimum of 0 (all delay bits, no side-set) and maximum
//               of 5 (all side-set, no delay).
#define PIO_SM3_PINCTRL_SIDESET_COUNT_RESET  _u(0x0)
#define PIO_SM3_PINCTRL_SIDESET_COUNT_BITS   _u(0xe0000000)
#define PIO_SM3_PINCTRL_SIDESET_COUNT_MSB    _u(31)
#define PIO_SM3_PINCTRL_SIDESET_COUNT_LSB    _u(29)
#define PIO_SM3_PINCTRL_SIDESET_COUNT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_PINCTRL_SET_COUNT
// Description : The number of pins asserted by a SET. In the range 0 to 5
//               inclusive.
#define PIO_SM3_PINCTRL_SET_COUNT_RESET  _u(0x5)
#define PIO_SM3_PINCTRL_SET_COUNT_BITS   _u(0x1c000000)
#define PIO_SM3_PINCTRL_SET_COUNT_MSB    _u(28)
#define PIO_SM3_PINCTRL_SET_COUNT_LSB    _u(26)
#define PIO_SM3_PINCTRL_SET_COUNT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_PINCTRL_OUT_COUNT
// Description : The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV
//               PINS instruction. In the range 0 to 32 inclusive.
#define PIO_SM3_PINCTRL_OUT_COUNT_RESET  _u(0x00)
#define PIO_SM3_PINCTRL_OUT_COUNT_BITS   _u(0x03f00000)
#define PIO_SM3_PINCTRL_OUT_COUNT_MSB    _u(25)
#define PIO_SM3_PINCTRL_OUT_COUNT_LSB    _u(20)
#define PIO_SM3_PINCTRL_OUT_COUNT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_PINCTRL_IN_BASE
// Description : The pin which is mapped to the least-significant bit of a state
//               machine's IN data bus. Higher-numbered pins are mapped to
//               consecutively more-significant data bits, with a modulo of 32
//               applied to pin number.
#define PIO_SM3_PINCTRL_IN_BASE_RESET  _u(0x00)
#define PIO_SM3_PINCTRL_IN_BASE_BITS   _u(0x000f8000)
#define PIO_SM3_PINCTRL_IN_BASE_MSB    _u(19)
#define PIO_SM3_PINCTRL_IN_BASE_LSB    _u(15)
#define PIO_SM3_PINCTRL_IN_BASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_PINCTRL_SIDESET_BASE
// Description : The lowest-numbered pin that will be affected by a side-set
//               operation. The MSBs of an instruction's side-set/delay field
//               (up to 5, determined by SIDESET_COUNT) are used for side-set
//               data, with the remaining LSBs used for delay. The least-
//               significant bit of the side-set portion is the bit written to
//               this pin, with more-significant bits written to higher-numbered
//               pins.
#define PIO_SM3_PINCTRL_SIDESET_BASE_RESET  _u(0x00)
#define PIO_SM3_PINCTRL_SIDESET_BASE_BITS   _u(0x00007c00)
#define PIO_SM3_PINCTRL_SIDESET_BASE_MSB    _u(14)
#define PIO_SM3_PINCTRL_SIDESET_BASE_LSB    _u(10)
#define PIO_SM3_PINCTRL_SIDESET_BASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_PINCTRL_SET_BASE
// Description : The lowest-numbered pin that will be affected by a SET PINS or
//               SET PINDIRS instruction. The data written to this pin is the
//               least-significant bit of the SET data.
#define PIO_SM3_PINCTRL_SET_BASE_RESET  _u(0x00)
#define PIO_SM3_PINCTRL_SET_BASE_BITS   _u(0x000003e0)
#define PIO_SM3_PINCTRL_SET_BASE_MSB    _u(9)
#define PIO_SM3_PINCTRL_SET_BASE_LSB    _u(5)
#define PIO_SM3_PINCTRL_SET_BASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PIO_SM3_PINCTRL_OUT_BASE
// Description : The lowest-numbered pin that will be affected by an OUT PINS,
//               OUT PINDIRS or MOV PINS instruction. The data written to this
//               pin will always be the least-significant bit of the OUT or MOV
//               data.
#define PIO_SM3_PINCTRL_OUT_BASE_RESET  _u(0x00)
#define PIO_SM3_PINCTRL_OUT_BASE_BITS   _u(0x0000001f)
#define PIO_SM3_PINCTRL_OUT_BASE_MSB    _u(4)
#define PIO_SM3_PINCTRL_OUT_BASE_LSB    _u(0)
#define PIO_SM3_PINCTRL_OUT_BASE_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF0_PUTGET0
// Description : Direct read/write access to entry 0 of SM0's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF0_PUTGET0_OFFSET _u(0x00000128)
#define PIO_RXF0_PUTGET0_BITS   _u(0xffffffff)
#define PIO_RXF0_PUTGET0_RESET  _u(0x00000000)
#define PIO_RXF0_PUTGET0_MSB    _u(31)
#define PIO_RXF0_PUTGET0_LSB    _u(0)
#define PIO_RXF0_PUTGET0_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF0_PUTGET1
// Description : Direct read/write access to entry 1 of SM0's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF0_PUTGET1_OFFSET _u(0x0000012c)
#define PIO_RXF0_PUTGET1_BITS   _u(0xffffffff)
#define PIO_RXF0_PUTGET1_RESET  _u(0x00000000)
#define PIO_RXF0_PUTGET1_MSB    _u(31)
#define PIO_RXF0_PUTGET1_LSB    _u(0)
#define PIO_RXF0_PUTGET1_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF0_PUTGET2
// Description : Direct read/write access to entry 2 of SM0's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF0_PUTGET2_OFFSET _u(0x00000130)
#define PIO_RXF0_PUTGET2_BITS   _u(0xffffffff)
#define PIO_RXF0_PUTGET2_RESET  _u(0x00000000)
#define PIO_RXF0_PUTGET2_MSB    _u(31)
#define PIO_RXF0_PUTGET2_LSB    _u(0)
#define PIO_RXF0_PUTGET2_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF0_PUTGET3
// Description : Direct read/write access to entry 3 of SM0's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF0_PUTGET3_OFFSET _u(0x00000134)
#define PIO_RXF0_PUTGET3_BITS   _u(0xffffffff)
#define PIO_RXF0_PUTGET3_RESET  _u(0x00000000)
#define PIO_RXF0_PUTGET3_MSB    _u(31)
#define PIO_RXF0_PUTGET3_LSB    _u(0)
#define PIO_RXF0_PUTGET3_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF1_PUTGET0
// Description : Direct read/write access to entry 0 of SM1's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF1_PUTGET0_OFFSET _u(0x00000138)
#define PIO_RXF1_PUTGET0_BITS   _u(0xffffffff)
#define PIO_RXF1_PUTGET0_RESET  _u(0x00000000)
#define PIO_RXF1_PUTGET0_MSB    _u(31)
#define PIO_RXF1_PUTGET0_LSB    _u(0)
#define PIO_RXF1_PUTGET0_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF1_PUTGET1
// Description : Direct read/write access to entry 1 of SM1's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF1_PUTGET1_OFFSET _u(0x0000013c)
#define PIO_RXF1_PUTGET1_BITS   _u(0xffffffff)
#define PIO_RXF1_PUTGET1_RESET  _u(0x00000000)
#define PIO_RXF1_PUTGET1_MSB    _u(31)
#define PIO_RXF1_PUTGET1_LSB    _u(0)
#define PIO_RXF1_PUTGET1_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF1_PUTGET2
// Description : Direct read/write access to entry 2 of SM1's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF1_PUTGET2_OFFSET _u(0x00000140)
#define PIO_RXF1_PUTGET2_BITS   _u(0xffffffff)
#define PIO_RXF1_PUTGET2_RESET  _u(0x00000000)
#define PIO_RXF1_PUTGET2_MSB    _u(31)
#define PIO_RXF1_PUTGET2_LSB    _u(0)
#define PIO_RXF1_PUTGET2_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF1_PUTGET3
// Description : Direct read/write access to entry 3 of SM1's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF1_PUTGET3_OFFSET _u(0x00000144)
#define PIO_RXF1_PUTGET3_BITS   _u(0xffffffff)
#define PIO_RXF1_PUTGET3_RESET  _u(0x00000000)
#define PIO_RXF1_PUTGET3_MSB    _u(31)
#define PIO_RXF1_PUTGET3_LSB    _u(0)
#define PIO_RXF1_PUTGET3_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF2_PUTGET0
// Description : Direct read/write access to entry 0 of SM2's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF2_PUTGET0_OFFSET _u(0x00000148)
#define PIO_RXF2_PUTGET0_BITS   _u(0xffffffff)
#define PIO_RXF2_PUTGET0_RESET  _u(0x00000000)
#define PIO_RXF2_PUTGET0_MSB    _u(31)
#define PIO_RXF2_PUTGET0_LSB    _u(0)
#define PIO_RXF2_PUTGET0_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF2_PUTGET1
// Description : Direct read/write access to entry 1 of SM2's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF2_PUTGET1_OFFSET _u(0x0000014c)
#define PIO_RXF2_PUTGET1_BITS   _u(0xffffffff)
#define PIO_RXF2_PUTGET1_RESET  _u(0x00000000)
#define PIO_RXF2_PUTGET1_MSB    _u(31)
#define PIO_RXF2_PUTGET1_LSB    _u(0)
#define PIO_RXF2_PUTGET1_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF2_PUTGET2
// Description : Direct read/write access to entry 2 of SM2's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF2_PUTGET2_OFFSET _u(0x00000150)
#define PIO_RXF2_PUTGET2_BITS   _u(0xffffffff)
#define PIO_RXF2_PUTGET2_RESET  _u(0x00000000)
#define PIO_RXF2_PUTGET2_MSB    _u(31)
#define PIO_RXF2_PUTGET2_LSB    _u(0)
#define PIO_RXF2_PUTGET2_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF2_PUTGET3
// Description : Direct read/write access to entry 3 of SM2's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF2_PUTGET3_OFFSET _u(0x00000154)
#define PIO_RXF2_PUTGET3_BITS   _u(0xffffffff)
#define PIO_RXF2_PUTGET3_RESET  _u(0x00000000)
#define PIO_RXF2_PUTGET3_MSB    _u(31)
#define PIO_RXF2_PUTGET3_LSB    _u(0)
#define PIO_RXF2_PUTGET3_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF3_PUTGET0
// Description : Direct read/write access to entry 0 of SM3's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF3_PUTGET0_OFFSET _u(0x00000158)
#define PIO_RXF3_PUTGET0_BITS   _u(0xffffffff)
#define PIO_RXF3_PUTGET0_RESET  _u(0x00000000)
#define PIO_RXF3_PUTGET0_MSB    _u(31)
#define PIO_RXF3_PUTGET0_LSB    _u(0)
#define PIO_RXF3_PUTGET0_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF3_PUTGET1
// Description : Direct read/write access to entry 1 of SM3's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF3_PUTGET1_OFFSET _u(0x0000015c)
#define PIO_RXF3_PUTGET1_BITS   _u(0xffffffff)
#define PIO_RXF3_PUTGET1_RESET  _u(0x00000000)
#define PIO_RXF3_PUTGET1_MSB    _u(31)
#define PIO_RXF3_PUTGET1_LSB    _u(0)
#define PIO_RXF3_PUTGET1_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF3_PUTGET2
// Description : Direct read/write access to entry 2 of SM3's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF3_PUTGET2_OFFSET _u(0x00000160)
#define PIO_RXF3_PUTGET2_BITS   _u(0xffffffff)
#define PIO_RXF3_PUTGET2_RESET  _u(0x00000000)
#define PIO_RXF3_PUTGET2_MSB    _u(31)
#define PIO_RXF3_PUTGET2_LSB    _u(0)
#define PIO_RXF3_PUTGET2_ACCESS "RW"
// =============================================================================
// Register    : PIO_RXF3_PUTGET3
// Description : Direct read/write access to entry 3 of SM3's RX FIFO, if
//               SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.
#define PIO_RXF3_PUTGET3_OFFSET _u(0x00000164)
#define PIO_RXF3_PUTGET3_BITS   _u(0xffffffff)
#define PIO_RXF3_PUTGET3_RESET  _u(0x00000000)
#define PIO_RXF3_PUTGET3_MSB    _u(31)
#define PIO_RXF3_PUTGET3_LSB    _u(0)
#define PIO_RXF3_PUTGET3_ACCESS "RW"
// =============================================================================
// Register    : PIO_GPIOBASE
// Description : Relocate GPIO 0 (from PIO's point of view) in the system GPIO
//               numbering, to access more than 32 GPIOs from PIO.
//
//               Only the values 0 and 16 are supported (only bit 4 is
//               writable).
#define PIO_GPIOBASE_OFFSET _u(0x00000168)
#define PIO_GPIOBASE_BITS   _u(0x00000010)
#define PIO_GPIOBASE_RESET  _u(0x00000000)
#define PIO_GPIOBASE_MSB    _u(4)
#define PIO_GPIOBASE_LSB    _u(4)
#define PIO_GPIOBASE_ACCESS "RW"
// =============================================================================
// Register    : PIO_INTR
// Description : Raw Interrupts
#define PIO_INTR_OFFSET _u(0x0000016c)
#define PIO_INTR_BITS   _u(0x0000ffff)
#define PIO_INTR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM7
#define PIO_INTR_SM7_RESET  _u(0x0)
#define PIO_INTR_SM7_BITS   _u(0x00008000)
#define PIO_INTR_SM7_MSB    _u(15)
#define PIO_INTR_SM7_LSB    _u(15)
#define PIO_INTR_SM7_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM6
#define PIO_INTR_SM6_RESET  _u(0x0)
#define PIO_INTR_SM6_BITS   _u(0x00004000)
#define PIO_INTR_SM6_MSB    _u(14)
#define PIO_INTR_SM6_LSB    _u(14)
#define PIO_INTR_SM6_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM5
#define PIO_INTR_SM5_RESET  _u(0x0)
#define PIO_INTR_SM5_BITS   _u(0x00002000)
#define PIO_INTR_SM5_MSB    _u(13)
#define PIO_INTR_SM5_LSB    _u(13)
#define PIO_INTR_SM5_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM4
#define PIO_INTR_SM4_RESET  _u(0x0)
#define PIO_INTR_SM4_BITS   _u(0x00001000)
#define PIO_INTR_SM4_MSB    _u(12)
#define PIO_INTR_SM4_LSB    _u(12)
#define PIO_INTR_SM4_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM3
#define PIO_INTR_SM3_RESET  _u(0x0)
#define PIO_INTR_SM3_BITS   _u(0x00000800)
#define PIO_INTR_SM3_MSB    _u(11)
#define PIO_INTR_SM3_LSB    _u(11)
#define PIO_INTR_SM3_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM2
#define PIO_INTR_SM2_RESET  _u(0x0)
#define PIO_INTR_SM2_BITS   _u(0x00000400)
#define PIO_INTR_SM2_MSB    _u(10)
#define PIO_INTR_SM2_LSB    _u(10)
#define PIO_INTR_SM2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM1
#define PIO_INTR_SM1_RESET  _u(0x0)
#define PIO_INTR_SM1_BITS   _u(0x00000200)
#define PIO_INTR_SM1_MSB    _u(9)
#define PIO_INTR_SM1_LSB    _u(9)
#define PIO_INTR_SM1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM0
#define PIO_INTR_SM0_RESET  _u(0x0)
#define PIO_INTR_SM0_BITS   _u(0x00000100)
#define PIO_INTR_SM0_MSB    _u(8)
#define PIO_INTR_SM0_LSB    _u(8)
#define PIO_INTR_SM0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM3_TXNFULL
#define PIO_INTR_SM3_TXNFULL_RESET  _u(0x0)
#define PIO_INTR_SM3_TXNFULL_BITS   _u(0x00000080)
#define PIO_INTR_SM3_TXNFULL_MSB    _u(7)
#define PIO_INTR_SM3_TXNFULL_LSB    _u(7)
#define PIO_INTR_SM3_TXNFULL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM2_TXNFULL
#define PIO_INTR_SM2_TXNFULL_RESET  _u(0x0)
#define PIO_INTR_SM2_TXNFULL_BITS   _u(0x00000040)
#define PIO_INTR_SM2_TXNFULL_MSB    _u(6)
#define PIO_INTR_SM2_TXNFULL_LSB    _u(6)
#define PIO_INTR_SM2_TXNFULL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : PIO_INTR_SM1_TXNFULL
#define PIO_INTR_SM1_TXNFULL_RESET  _u(0x0)
#define PIO_INTR_SM1_TXNFULL_BITS   _u(0x00000020)
#define PIO_INTR_SM1_TXNFULL_MSB    _u(5)
#define PIO_INTR_SM1_TXNFULL_LSB    _u(5)
#define PIO_INTR_SM1_TXNFULL_ACCESS "RO"
